app/Http/Controllers/HomeController.php

SELECT * FROM `categories` WHERE `categories`.`id` in (1, 2, 3, 4, 5)
SELECT * FROM `posts`
---
    public function index()
    {
        return view('index',[
            'posts' => Post::all(),
            'categories' => Category::withCount('posts')->get()
        ]);